/* Вася не любит английский язык, но каждый раз старается получить хотя бы четверку за четверть,
чтобы оставаться ударником. В текущей четверти Вася заметил следующую закономерность:
по нечетным дням месяца он получал тройки, а по четным – четверки.
Так же он помнит, в какие дни он получал эти оценки. Поэтому он выписал на бумажке все эти дни для того,
чтобы оценить, сколько у него троек и сколько четверок. Помогите Васе это сделать,
расположив четные и нечетные числа в разных строчках.
Вася может рассчитывать на оценку 4, если четверок не меньше, чем троек.

Входные данные
В первой строке входного файла INPUT.TXT записано единственное число N – количество элементов целочисленного массива
(1 ≤ N ≤ 100). Вторая строка содержит N чисел, представляющих заданный массив.
Каждый элемент массива – натуральное число от 1 до 31. Все элементы массива разделены пробелом.

Выходные данные
В первую строку выходного файла OUTPUT.TXT нужно вывести числа, которые соответствуют дням месяцев,
в которые Вася получил тройки, а во второй строке соответственно расположить числа месяца, в которые Вася получил четверки.
В третьей строке нужно вывести «YES», если Вася может рассчитывать на четверку и «NO» в противном случае.
В каждой строчке числа следует выводить в том же порядке, в котором они идут во входных данных.
При выводе числа отделяются пробелом. */
Console.Clear();
Console.Write("Введите количество дней (1-100): ");
int n = Convert.ToInt32(Console.ReadLine());
while(n < 1 || n > 100){
    Console.Write("Введите КОРРЕКТНОЕ число дней (от 1 до 100): ");
n = Convert.ToInt32(Console.ReadLine());
}
int[] arr = new int[n];
for(int i = 0; i < arr.Length; i++){
 arr[i] = new Random().Next(1, 32);
}
Console.WriteLine($"[{String.Join(", ", arr)}]");

int even = 0;
int odd = 0;

for(int i = 0; i < arr.Length; i++){
    if(arr[i] % 2 == 0){
        even++;
        }
    else{
        odd++;
    }
}

int[] evens = new int[even];
int[] odds = new int[odd];

    int i_ev = 0;
    int i_od = 0;

for(int i = 0; i < arr.Length; i++){

    if(arr[i] % 2 == 0){
        evens[i_ev] = arr[i];
        i_ev++;
        }
    else{
        odds[i_od] = arr[i];
        i_od++;
    }
}
Console.WriteLine($"Чётные: [{String.Join(", ", evens)}]");
Console.WriteLine($"Нечётные: [{String.Join(", ", odds)}]");
Console.WriteLine(evens.Length > odds.Length);